// éØï éqÇ…ä÷Ç∑ÇÈà”ñ°âêÕÉeÉXÉgÅiç\ï∂âêÕÇÃÉeÉXÉgÇÕÅAäeé©Ç™çsÇ§Ç±Ç∆Åj
//
// ident.javaÇÃsemanticCheckÉÅÉ\ÉbÉhÇÃÇ∆Ç±ÇÎÇÕÅAÇ±Ç§Ç»Ç¡ÇƒÇ¢ÇÈÇÕÇ∏
//
// public void semanticCheck(CParseContext pcx) throws FatalErrorException {
// 	this.setCType(CType.getCType(CType.XXXXX));						// 	this.setConstant(YYYYY);
// }

// (1) XXXXX ÇêÆêîå^ T_int Ç…ÅAYYYYYÇfalseÇ…ÇµÇƒ
a	// ê≥ìñÅiê∂ê¨ÉRÅ[ÉhÇ™ê≥ÇµÇ¢Ç©Ç«Ç§Ç©Ç‡ämîFÅj
//*a	// ïsìñ
//a[3]	// ïsìñ
//
//// (2) XXXXX ÇÉ|ÉCÉìÉ^å^ T_pint Ç…ÅAYYYYYÇfalseÇ…ÇµÇƒ
//a	// ê≥ìñ
//*a	// ê≥ìñÅiê∂ê¨ÉRÅ[ÉhÇ™ê≥ÇµÇ¢Ç©Ç«Ç§Ç©Ç‡ämîFÅj
//a[3]	// ïsìñÅiÇbÇ≈ÇÕê≥ìñÇæÇ™ÅAÇ±ÇÃé¿å±Ç≈ÇÕïsìñÇ…Ç∑ÇÈÇ±Ç∆Åj
//
//// (3) XXXXX ÇîzóÒå^ T_arrayÅiêlÇ…ÇÊÇ¡ÇƒÇ±ÇÃñºëOÇÕàŸÇ»ÇÈÅjÇ…ÅAYYYYYÇfalseÇ…ÇµÇƒ
////  ÅñÅñÅñÅñÅñÅñÅñÅñÅñÅñÅñÅñÅñ 2018/10/26 ïœçX ÅñÅñÅñÅñÅñÅñÅñÅñÅñÅñ
//a	// ïsìñÅi10/26ÇÊÇËëOÇÕê≥ìñÇ∆Ç»Ç¡ÇƒÇ¢ÇΩÅj
//*a	// ïsìñÅiÇbÇ≈ÇÕê≥ìñÇæÇ™ÅAÇ±ÇÃé¿å±Ç≈ÇÕïsìñÇ…Ç∑ÇÈÇ±Ç∆Åj
//a[3]	// ê≥ìñÅiê∂ê¨ÉRÅ[ÉhÇ™ê≥ÇµÇ¢Ç©Ç«Ç§Ç©Ç‡ämîFÅj
//a[a[3]] // ê≥ìñÅi11/2í«â¡Åj
//a[&3]	// ïsìñÅi[]ì‡ÇÕêÆêîå^Ç≈Ç»ÇØÇÍÇŒÇ»ÇÁÇ»Ç¢Åj
//
//// (4) XXXXX ÇÉ|ÉCÉìÉ^îzóÒå^ T_parrayÅiêlÇ…ÇÊÇ¡ÇƒÇ±ÇÃñºëOÇÕàŸÇ»ÇÈÅjÇ…ÅAYYYYYÇfalseÇ…ÇµÇƒ
////  ÅñÅñÅñÅñÅñÅñÅñÅñÅñÅñÅñÅñÅñ 2018/10/26 ïœçX ÅñÅñÅñÅñÅñÅñÅñÅñÅñÅñ
//a	// ïsìñÅi10/26ÇÊÇËëOÇÕê≥ìñÇ∆Ç»Ç¡ÇƒÇ¢ÇΩÅj
//*a	// ïsìñÅiÇbÇ≈ÇÕê≥ìñÇæÇ™ÅAÇ±ÇÃé¿å±Ç≈ÇÕïsìñÇ…Ç∑ÇÈÇ±Ç∆Åj
//a[3]	// ê≥ìñ
//a[3]+a[3] // ïsìñÅi11/2í«â¡Åj
//*a[3]	// ê≥ìñÅiê∂ê¨ÉRÅ[ÉhÇ™ê≥ÇµÇ¢Ç©Ç«Ç§Ç©Ç‡ämîFÅj
//a[&3]	// ïsìñÅi[]ì‡ÇÕêÆêîå^Ç≈Ç»ÇØÇÍÇŒÇ»ÇÁÇ»Ç¢Åj
//
//// (5)
//&*var	// ïsìñ
